---
type: DataTransferProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# DataTransferProgressChangedEventArgs

`Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | FinishedSize | 2017 Subscription Update | `public double FinishedSize { get ; }` |
| Property | Speed | 2017 Subscription Update | `public double Speed { get ; }` |
| Property | TotalSize | 2017 Subscription Update | `public double TotalSize { get ; }` |
| Property | TransferMode | 2017 Subscription Update | `public DataTransferMode TransferMode { get ; }` |